convert graphviz to mermaid for gh preview
